<script setup lang="ts">

</script>

<template>


  <div class="wrapper">

    <v-expansion-panels class="flex">
      <v-expansion-panel title="13.06.2024">
        <v-expansion-panel-text>
          <p>- Исправлена ошибка с отображением данных в карточках организаций (все данные подргружаются и отображаются корректно)</p>
          <p> - Доработан полный адаптив главной страницы с планшетной и мобильной версиями</p>
          <p> - Адаптив фильтров во вкладке "организации"</p>
          <p>- Исправлена серверная ошибка, при которой невозможно было отобразить страницу при перезагрузке страницы, находясь не на главной странице</p>
          <p>- Коррекция размеров карточек организаций и образовательных программ на экранах ноутбуков и платшетов горизонтальной ориентации</p>
          <p>- Убран баг с отображением лого новостей</p>
          <p>- Задана функциональность для всех кнопок на главной странице</p>
        </v-expansion-panel-text>
      </v-expansion-panel>
    </v-expansion-panels>

  </div>

</template>

<style scoped>

.flex {
  display: flex;
  flex-direction: column;
  gap: 1rem;
}
</style>